/*
    [문제 31]

    * 헤더파일에 넣을 수 있는 대상의 범위는 어떻게 되는가?
    범위에는 제한은 없다. 무엇이든 넣을 수 있다. 그러나 무엇이든 넣어도 좋다는 뜻은 아니다. 무엇이든 넣을 수 있으나 아무것이나 넣는 것은 좋지 못하다. 
    넣어서 좋은 것도 있고, 나쁜 것도 있다. 다음에 제시되는 문제 중에는 이 둘의 구분 방법을 주제로 한 문제도 있다.

    * 전처리기가 동작하는 시점은 언제인가?
    실행파일이 만들어지는 과정은 다음과 같다.
    "전처리기에 의한 전처리 -> 컴파일러에 의한 컴파일  -> 링커에 의한 링킹(Linking)"
    즉, 컴파일 이전, 또는 실행파일이 만들어지는 과정 중 제일 앞부분에 동작한다고 말할 수 있다. 

    * 전처리기가 #include 문을 접했을 때 하는 행동은 무엇인가?
    '포함' 또는 '대체(interchange)'라고 말할 수 있다. #include 문이 지시하는 vkdlfdp wjwkdehls sodyddl #include 문장을 대신하여 삽입된다. 
*/